Documents/ВозмещениеБольничныхВЧастиФБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВозмещениеБольничныхВЧастиФБ</Name>
			<Comment>АПК:58 Имя определяет задачу, синоним - актуальную реализацию в соответствии с НПА.</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТерриториальногоОрганаФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>135</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКодФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодчиненностиФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочтыОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявленийИРеестровНаВыплатуПособий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пособия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Больничный</Name>
							<Comment>Документ, который зарегистрировал пособие</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтраховогоСлучая</Name>
							<Comment>Дата начала болезни</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58 физлицо в роли получателя пособия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФинансируемаяРаботодателем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСверхНорм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФикс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПособияПоСоциальномуСтрахованию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПособияПоСоциальномуСтрахованию</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтраховыеСлучаи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСверхНорм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФинансируемаяРаботодателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтраховогоСлучая</Name>
					<Comment>Дата начала болезни, дата рождения ребенка и т.п.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПособияСоциальногоСтрахования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПереченьПособийСоциальногоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФинансированиеФедеральнымБюджетом</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозмещениеБольничныхВЧастиФБ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Удаление непроверяемых реквизитов.
	НепроверяемыеРеквизиты = Новый Массив;
	Если Не РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Организация) Тогда
		НепроверяемыеРеквизиты.Добавить("КПП");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	// Отсутствие дублей в табличной части.
	Количество = Пособия.Количество();
	Если Количество > 1 Тогда
		ТаблицаПроверки = Пособия.Выгрузить(, "НомерСтроки, ФизическоеЛицо, ДатаСтраховогоСлучая");
		ТаблицаПроверки.Сортировать("ФизическоеЛицо, ДатаСтраховогоСлучая, НомерСтроки");
		ПредшествующаяСтрока = ТаблицаПроверки[0];
		Для ИндексСтроки = 1 По Количество - 1 Цикл
			СтрокаТаблицы = ТаблицаПроверки[ИндексСтроки];
			Если ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо)
				И СтрокаТаблицы.ФизическоеЛицо = ПредшествующаяСтрока.ФизическоеЛицо
				И СтрокаТаблицы.ДатаСтраховогоСлучая = ПредшествующаяСтрока.ДатаСтраховогоСлучая Тогда
				Текст = СтрШаблон(
					НСтр("ru = 'Пособие %1 от %2 дублируется в строках %3 и %4.'"),
					СтрокаТаблицы.ФизическоеЛицо,
					СтрокаТаблицы.ДатаСтраховогоСлучая,
					ПредшествующаяСтрока.НомерСтроки,
					СтрокаТаблицы.НомерСтроки);
				ИмяРеквизита = "ДатаСтраховогоСлучая";
				СообщенияБЗК.СообщитьОбОшибкеВСтрокеТаблицы(Отказ, ЭтотОбъект, "Пособия", СтрокаТаблицы, ИмяРеквизита, Текст);
			КонецЕсли;
			ПредшествующаяСтрока = СтрокаТаблицы;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ОбъектЗафиксирован() Экспорт
	Возврат Не ПрямыеВыплатыПособийСоциальногоСтрахования.СтатусПозволяетРедактироватьДокумент(СтатусДокумента);
КонецФункции

Функция ОбновитьВторичныеДанныеДокумента() Экспорт
	Если ОбъектЗафиксирован() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Метаданные().ПолноеИмя());
	ПараметрыФиксации = Менеджер.ПараметрыФиксацииВторичныхДанных();
	Модифицирован = Ложь;
	
	Если ОбновитьДанныеОрганизации(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	Если ОбновитьДанныеБольничных(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	Если ОбновитьСуммыПособий(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	Если ОбновитьДанныеФизическихЛиц(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция ОбновитьДанныеОрганизации(ПараметрыФиксации)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура(
		"РегистрационныйНомерФСС,ДополнительныйКодФСС,КодПодчиненностиФСС,НаименованиеТерриториальногоОрганаФСС,ИНН,КПП,
		|Руководитель,ДолжностьРуководителя,ОснованиеПодписиРуководителя,ТелефонСоставителя,АдресОрганизации,АдресЭлектроннойПочтыОрганизации,
		|Банк,НаименованиеБанка,НомерЛицевогоСчета,НомерСчета,БИКБанка");
	
	СведенияОПодписях = ПодписиДокументов.СведенияОПодписяхПоУмолчаниюДляОбъектаМетаданных(Метаданные(), Организация);
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, СведенияОПодписях);
	
	ИменаПолей =
	"РегистрационныйНомерФСС,
	|КодПодчиненностиФСС,
	|ДополнительныйКодФСС,
	|НаименованиеТерриториальногоОрганаФСС,
	|ИННЮЛ,
	|КППЮЛ,
	|БанкСчетНомер,
	|БанкСчетНаимБанка,
	|БанкСчетБИКБанка,
	|АдрЮР_JSON,
	|ТелОрганизации_JSON,
	|АдресЭлектроннойПочтыОрганизации";
	СведенияОСтрахователе = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей, Дата);
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, СведенияОСтрахователе);
	
	РеквизитыДокумента.ИНН                = СведенияОСтрахователе.ИННЮЛ;
	РеквизитыДокумента.КПП                = СведенияОСтрахователе.КППЮЛ;
	РеквизитыДокумента.НомерСчета         = СведенияОСтрахователе.БанкСчетНомер;
	РеквизитыДокумента.НаименованиеБанка  = СведенияОСтрахователе.БанкСчетНаимБанка;
	РеквизитыДокумента.БИКБанка           = СведенияОСтрахователе.БанкСчетБИКБанка;
	РеквизитыДокумента.АдресОрганизации   = СведенияОСтрахователе.АдрЮР_JSON;
	РеквизитыДокумента.ТелефонСоставителя = СведенияОСтрахователе.ТелОрганизации_JSON;
	РеквизитыДокумента.АдресЭлектроннойПочтыОрганизации = СведенияОСтрахователе.АдресЭлектроннойПочтыОрганизации;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыДокумента, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ОбновитьДанныеБольничных(ПараметрыФиксации)
	Больничные = Пособия.ВыгрузитьКолонку("Больничный");
	ОбратныйИндекс = Больничные.Количество();
	Пока ОбратныйИндекс > 0 Цикл
		ОбратныйИндекс = ОбратныйИндекс - 1;
		Если Не ЗначениеЗаполнено(Больничные[ОбратныйИндекс]) Тогда
			Больничные.Удалить(ОбратныйИндекс);
		КонецЕсли;
	КонецЦикла;
	Если Больничные.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = "ФизическоеЛицо, ДатаНачалаСобытия, ДатаНачала, ДатаОкончания";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Больничные, Реквизиты, Истина);
	НовыеЗначения = Новый Структура("ФизическоеЛицо, ДатаСтраховогоСлучая, ДатаНачала, ДатаОкончания");
	ОбъектМодифицирован = Ложь;
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
		ЗаполнитьЗначенияСвойств(НовыеЗначения, КлючИЗначение.Значение);
		НовыеЗначения.ДатаСтраховогоСлучая = КлючИЗначение.Значение.ДатаНачалаСобытия;
		Найденные = Пособия.НайтиСтроки(Новый Структура("Больничный", КлючИЗначение.Ключ));
		Для Каждого СтрокаПособия Из Найденные Цикл
			Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеСтроки(
				НовыеЗначения,
				ЭтотОбъект,
				"Пособия",
				СтрокаПособия,
				ПараметрыФиксации) Тогда
				ОбъектМодифицирован = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ОбъектМодифицирован;
КонецФункции

Функция ОбновитьСуммыПособий(ПараметрыФиксации)
	Больничные = Пособия.ВыгрузитьКолонку("Больничный");
	ОбратныйИндекс = Больничные.Количество();
	Пока ОбратныйИндекс > 0 Цикл
		ОбратныйИндекс = ОбратныйИндекс - 1;
		Если Не ЗначениеЗаполнено(Больничные[ОбратныйИндекс]) Тогда
			Больничные.Удалить(ОбратныйИндекс);
		КонецЕсли;
	КонецЦикла;
	Если Больничные.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	СоздатьВТСуммыКВозмещению(МенеджерВТ, Истина);
	СуммыКВозмещению    = МенеджерВТ.Таблицы["ВТСуммыКВозмещению"].ПолучитьДанные().Выгрузить();
	НовыеЗначения       = Новый Структура("СуммаСверхНорм, СуммаФинансируемаяРаботодателем");
	Фильтр              = Новый Структура("ДатаСтраховогоСлучая, ФизическоеЛицо");
	ОбъектМодифицирован = Ложь;
	Для Каждого СтрокаСумм Из СуммыКВозмещению Цикл
		ЗаполнитьЗначенияСвойств(НовыеЗначения, СтрокаСумм);
		ЗаполнитьЗначенияСвойств(Фильтр, СтрокаСумм);
		Найденные = Пособия.НайтиСтроки(Фильтр);
		Для Каждого СтрокаПособия Из Найденные Цикл
			Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеСтроки(
				НовыеЗначения,
				ЭтотОбъект,
				"Пособия",
				СтрокаПособия,
				ПараметрыФиксации) Тогда
				ОбъектМодифицирован = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ОбъектМодифицирован;
КонецФункции

Функция ОбновитьДанныеФизическихЛиц(ПараметрыФиксации)
	МассивФизлиц = Пособия.ВыгрузитьКолонку("ФизическоеЛицо");
	ОбратныйИндекс = МассивФизлиц.Количество();
	Пока ОбратныйИндекс > 0 Цикл
		ОбратныйИндекс = ОбратныйИндекс - 1;
		Если Не ЗначениеЗаполнено(МассивФизлиц[ОбратныйИндекс]) Тогда
			МассивФизлиц.Удалить(ОбратныйИндекс);
		КонецЕсли;
	КонецЦикла;
	Если МассивФизлиц.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТолькоРазрешенные = Истина;
	ИменаПолей = "Фамилия,Имя,Отчество,СтраховойНомерПФР";
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(ТолькоРазрешенные, МассивФизлиц, ИменаПолей, Дата);
	
	ОбъектМодифицирован = Ложь;
	НовыеЗначения = Новый Структура("Фамилия, Имя, Отчество, СНИЛС");
	Для Каждого СтрокаТаблицы Из КадровыеДанные Цикл
		ЗаполнитьЗначенияСвойств(НовыеЗначения, СтрокаТаблицы);
		НовыеЗначения.СНИЛС = СтрокаТаблицы.СтраховойНомерПФР;
		Найденные = Пособия.НайтиСтроки(Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо));
		Для Каждого СтрокаПособия Из Найденные Цикл
			Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеСтроки(
				НовыеЗначения,
				ЭтотОбъект,
				"Пособия",
				СтрокаПособия,
				ПараметрыФиксации) Тогда
				ОбъектМодифицирован = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ОбъектМодифицирован;
КонецФункции

#КонецОбласти

#Область Заполнить

Процедура ЗаполнитьДокумент() Экспорт
	Пособия.Очистить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	СоздатьВТСуммыКВозмещению(МенеджерВТ, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТСуммыКВозмещению.Больничный КАК Больничный,
	|	ВТСуммыКВозмещению.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
	|	ВТСуммыКВозмещению.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТСуммыКВозмещению.СуммаСверхНорм КАК СуммаСверхНорм,
	|	ВТСуммыКВозмещению.СуммаФинансируемаяРаботодателем КАК СуммаФинансируемаяРаботодателем
	|ИЗ
	|	ВТСуммыКВозмещению КАК ВТСуммыКВозмещению
	|ГДЕ
	|	ВТСуммыКВозмещению.СуммаСверхНорм > 0";
	
	СуммыКВозмещению = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСумм Из СуммыКВозмещению Цикл
		ЗаполнитьЗначенияСвойств(Пособия.Добавить(), СтрокаСумм);
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьВТСуммыКВозмещению(МенеджерВТ, ФильтроватьПоИспользуемым)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Если ФильтроватьПоИспользуемым Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Пособия.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Пособия.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
		|	Пособия.Больничный КАК Больничный
		|ПОМЕСТИТЬ ВТПособия
		|ИЗ
		|	&Пособия КАК Пособия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Таблица.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
		|	МАКСИМУМ(Таблица.Больничный) КАК Больничный
		|ПОМЕСТИТЬ ВТСтраховыеСлучаи
		|ИЗ
		|	ВТПособия КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ФизическоеЛицо,
		|	Таблица.ДатаСтраховогоСлучая";
		Запрос.УстановитьПараметр("Пособия", Пособия.Выгрузить(, "ФизическоеЛицо, ДатаСтраховогоСлучая, Больничный"));
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регистр.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Регистр.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
		|	МАКСИМУМ(Регистр.Регистратор) КАК Больничный
		|ПОМЕСТИТЬ ВТСтраховыеСлучаи
		|ИЗ
		|	РегистрНакопления.ПособияПоСоциальномуСтрахованию КАК Регистр
		|ГДЕ
		|	Регистр.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И Регистр.СуммаСверхНорм <> 0
		|	И Регистр.Организация = &Организация
		|	И Регистр.ВидПособияСоциальногоСтрахования = &Нетрудоспособность
		|
		|СГРУППИРОВАТЬ ПО
		|	Регистр.ФизическоеЛицо,
		|	Регистр.ДатаСтраховогоСлучая";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(ДобавитьМесяц(Дата, -6)));
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Дата));
		Запрос.УстановитьПараметр("Нетрудоспособность", Перечисления.ПереченьПособийСоциальногоСтрахования.Нетрудоспособность);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
	"ВЫБРАТЬ
	|	ВТСтраховыеСлучаи.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТСтраховыеСлучаи.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
	|	ВТСтраховыеСлучаи.Больничный КАК Больничный,
	|	СУММА(ПособияПоСоциальномуСтрахованию.СуммаСверхНорм) КАК СуммаСверхНорм,
	|	СУММА(ПособияПоСоциальномуСтрахованию.СуммаФинансируемаяРаботодателем) КАК СуммаФинансируемаяРаботодателем
	|ПОМЕСТИТЬ ВТИзвестныеОснования
	|ИЗ
	|	ВТСтраховыеСлучаи КАК ВТСтраховыеСлучаи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПособияПоСоциальномуСтрахованию КАК ПособияПоСоциальномуСтрахованию
	|		ПО ВТСтраховыеСлучаи.ФизическоеЛицо = ПособияПоСоциальномуСтрахованию.ФизическоеЛицо
	|			И ВТСтраховыеСлучаи.ДатаСтраховогоСлучая = ПособияПоСоциальномуСтрахованию.ДатаСтраховогоСлучая
	|			И (ПособияПоСоциальномуСтрахованию.Организация = &Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтраховыеСлучаи.ФизическоеЛицо,
	|	ВТСтраховыеСлучаи.ДатаСтраховогоСлучая,
	|	ВТСтраховыеСлучаи.Больничный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Больничный КАК Больничный,
	|	ВложенныйЗапрос.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
	|	ВложенныйЗапрос.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВложенныйЗапрос.СуммаСверхНорм) КАК СуммаСверхНорм,
	|	СУММА(ВложенныйЗапрос.СуммаФинансируемаяРаботодателем) КАК СуммаФинансируемаяРаботодателем
	|ПОМЕСТИТЬ ВТСуммыКВозмещению
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТИзвестныеОснования.Больничный КАК Больничный,
	|		ВТИзвестныеОснования.ДатаСтраховогоСлучая КАК ДатаСтраховогоСлучая,
	|		ВТИзвестныеОснования.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ВТИзвестныеОснования.СуммаСверхНорм КАК СуммаСверхНорм,
	|		ВТИзвестныеОснования.СуммаФинансируемаяРаботодателем КАК СуммаФинансируемаяРаботодателем
	|	ИЗ
	|		ВТИзвестныеОснования КАК ВТИзвестныеОснования
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТИзвестныеОснования.Больничный,
	|		ВТИзвестныеОснования.ДатаСтраховогоСлучая,
	|		ВТИзвестныеОснования.ФизическоеЛицо,
	|		-ТЧПособия.СуммаСверхНорм,
	|		-ТЧПособия.СуммаФинансируемаяРаботодателем
	|	ИЗ
	|		ВТИзвестныеОснования КАК ВТИзвестныеОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозмещениеБольничныхВЧастиФБ.Пособия КАК ТЧПособия
	|			ПО ВТИзвестныеОснования.ДатаСтраховогоСлучая = ТЧПособия.ДатаСтраховогоСлучая
	|				И ВТИзвестныеОснования.ФизическоеЛицо = ТЧПособия.ФизическоеЛицо
	|				И (ТЧПособия.Ссылка <> &Ссылка)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозмещениеБольничныхВЧастиФБ КАК ВозмещениеБольничныхВЧастиФБ
	|			ПО (ТЧПособия.Ссылка = ВозмещениеБольничныхВЧастиФБ.Ссылка)
	|				И (ВозмещениеБольничныхВЧастиФБ.Проведен)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Больничный,
	|	ВложенныйЗапрос.ДатаСтраховогоСлучая,
	|	ВложенныйЗапрос.ФизическоеЛицо";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
